app/controllers/locations_controller.rb

     def index

          locations = Location.all

          if params[:setting]

               locations = Location.all.filter{|location| location.category_id == params[:setting].to_i}
---
SELECT "locations".* FROM "locations"
SELECT "settings".* FROM "settings"

    def show
     location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]