app/controllers/scenes_controller.rb

SELECT "scenes".* FROM "scenes"
---
def index
     scenes = Scene.all

SELECT "scenes".* FROM "scenes" WHERE "scenes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
def show
     scene = Scene.find(params[:id])