app/controllers/settings_controller.rb

     def index
          settings = Setting.all

          if params[:addresses]
               settings = Setting.all.filter{|setting| setting.options == params[:addresses]}
---
SELECT "settings".* FROM "settings"