app/controllers/shoots_controller.rb

     def create
          shoot = Shoot.create(params[:shoot][:title], params[:shoot][:date])

          params[:shoot][:scenes].each do |scene|
---
SELECT "shoots".* FROM "shoots" ORDER BY "shoots"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "scenes"."id" FROM "scenes" WHERE "scenes"."shoot_id" = $1  [["shoot_id", 4]]