app/controllers/shoots_controller.rb

SELECT "shoots".* FROM "shoots"
---
     def index
          shoots = Shoot.all

SELECT "shoots".* FROM "shoots" WHERE "shoots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
     def show
          shoot = Shoot.find(params[:id])

INSERT INTO "shoots" ("date", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", "2020-10-03"], ["title", "Avengers"], ["created_at", "2020-10-01 02:08:19.268258"], ["updated_at", "2020-10-01 02:08:19.268258"]]
SELECT "scenes"."id" FROM "scenes" WHERE "scenes"."shoot_id" = $1  [["shoot_id", 8]]
INSERT INTO "scenes" ("name", "location_id", "setting_id", "shoot_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Superhero Party"], ["location_id", 11], ["setting_id", 2], ["shoot_id", 8], ["created_at", "2020-10-01 02:08:19.295260"], ["updated_at", "2020-10-01 02:08:19.295260"]]
---
     def create

          params.permit!
          shoot = Shoot.create({title: params[:title], date: params[:date]})

          params[:scenes].each do |scene|
               scene[:shoot_id] = shoot.id

               Scene.create(scene)